In [1]:
import numpy as np
import pandas as pd

## Datafreym (DataFrame) ma ºlumotlar tuzilmasi

In [2]:
data = {
    'Yil':        [2021, 2020, 2019, 2018, 2017, 2016, 2015, 2010],
    'Aholi soni': [33.9, 33.5, 32.9, 32.5, 31.9, 31.4, 30.9, 28.5], 
    'Temp':       [1.54, 1.48, 1.56, 1.62, 1.65, 1.66, 1.64, 1.53]
}

In [3]:
df = pd.DataFrame(data)
df

    Yil  Aholi soni  Temp
0  2021        33.9  1.54
1  2020        33.5  1.48
2  2019        32.9  1.56
3  2018        32.5  1.62
4  2017        31.9  1.65
5  2016        31.4  1.66
6  2015        30.9  1.64
7  2010        28.5  1.53

In [4]:
df.shape

(8, 3)

In [5]:
df = pd.DataFrame(data, columns=['Yil', 'Temp', 'Aholi soni'])

In [6]:
df.sample()

    Yil  Temp  Aholi soni
2  2019  1.56        32.9

In [7]:
# index o'rnatish
df = pd.DataFrame(data, columns=['Yil', 'Temp', 'Aholi soni', 'GDP'], index = [21,20,19,18,17,16,15,10])

In [8]:
df

     Yil  Temp  Aholi soni  GDP
21  2021  1.54        33.9  NaN
20  2020  1.48        33.5  NaN
19  2019  1.56        32.9  NaN
18  2018  1.62        32.5  NaN
17  2017  1.65        31.9  NaN
16  2016  1.66        31.4  NaN
15  2015  1.64        30.9  NaN
10  2010  1.53        28.5  NaN

In [9]:
df.Temp

21    1.54
20    1.48
19    1.56
18    1.62
17    1.65
16    1.66
15    1.64
10    1.53
Name: Temp, dtype: float64

In [10]:
df.GDP = 0
df.sample()

     Yil  Temp  Aholi soni  GDP
15  2015  1.64        30.9    0

In [11]:
val = pd.Series([1700, 1650, 1500], index=[21,20,10])
df.GDP = val
df

     Yil  Temp  Aholi soni     GDP
21  2021  1.54        33.9  1700.0
20  2020  1.48        33.5  1650.0
19  2019  1.56        32.9     NaN
18  2018  1.62        32.5     NaN
17  2017  1.65        31.9     NaN
16  2016  1.66        31.4     NaN
15  2015  1.64        30.9     NaN
10  2010  1.53        28.5  1500.0

In [12]:
# NaN larga qiymat berish
val = [1700, 1650, 1600, 1500, 1450, 1400, 1380, 1350]
df.GDP = val
df

     Yil  Temp  Aholi soni   GDP
21  2021  1.54        33.9  1700
20  2020  1.48        33.5  1650
19  2019  1.56        32.9  1600
18  2018  1.62        32.5  1500
17  2017  1.65        31.9  1450
16  2016  1.66        31.4  1400
15  2015  1.64        30.9  1380
10  2010  1.53        28.5  1350

In [13]:
df['1500+'] = df.GDP>1500
df

     Yil  Temp  Aholi soni   GDP  1500+
21  2021  1.54        33.9  1700   True
20  2020  1.48        33.5  1650   True
19  2019  1.56        32.9  1600   True
18  2018  1.62        32.5  1500  False
17  2017  1.65        31.9  1450  False
16  2016  1.66        31.4  1400  False
15  2015  1.64        30.9  1380  False
10  2010  1.53        28.5  1350  False

In [14]:
del df['1500+']
df

     Yil  Temp  Aholi soni   GDP
21  2021  1.54        33.9  1700
20  2020  1.48        33.5  1650
19  2019  1.56        32.9  1600
18  2018  1.62        32.5  1500
17  2017  1.65        31.9  1450
16  2016  1.66        31.4  1400
15  2015  1.64        30.9  1380
10  2010  1.53        28.5  1350

## Lug ªatdan Datafreym yaratish

In [15]:
data = {
    'UZ': {2021:33.9, 2020:33.5, 2019:32.9, 2018:32.5, 2017:31.9},
    'KZ': {2021:18.9, 2020:18.7, 2019:18.5, 2018:18.3, 2017:18.1, 2016:17.8}
}
df2 = pd.DataFrame(data)
df2

        UZ    KZ
2021  33.9  18.9
2020  33.5  18.7
2019  32.9  18.5
2018  32.5  18.3
2017  31.9  18.1
2016   NaN  17.8

In [16]:
df2.index.name = 'Yil'

In [17]:
df2

        UZ    KZ
Yil
2021  33.9  18.9
2020  33.5  18.7
2019  32.9  18.5
2018  32.5  18.3
2017  31.9  18.1
2016   NaN  17.8

In [18]:
df2 = pd.DataFrame(data, index=[2021,2019,2017])
df2

        UZ    KZ
2021  33.9  18.9
2019  32.9  18.5
2017  31.9  18.1

In [19]:
df2.T

    2021  2019  2017
UZ  33.9  32.9  31.9
KZ  18.9  18.5  18.1

In [20]:
df2

        UZ    KZ
2021  33.9  18.9
2019  32.9  18.5
2017  31.9  18.1

In [21]:
df2.values

array([[33.9, 18.9],
       [32.9, 18.5],
       [31.9, 18.1]])

In [22]:
df

     Yil  Temp  Aholi soni   GDP
21  2021  1.54        33.9  1700
20  2020  1.48        33.5  1650
19  2019  1.56        32.9  1600
18  2018  1.62        32.5  1500
17  2017  1.65        31.9  1450
16  2016  1.66        31.4  1400
15  2015  1.64        30.9  1380
10  2010  1.53        28.5  1350

In [23]:
df.columns

Index(['Yil', 'Temp', 'Aholi soni', 'GDP'], dtype='object')

In [24]:
df.index

Index([21, 20, 19, 18, 17, 16, 15, 10], dtype='int64')

In [25]:
df2

        UZ    KZ
2021  33.9  18.9
2019  32.9  18.5
2017  31.9  18.1

In [26]:
'Tajikistan' in df2.columns

False

In [27]:
2021 in df2.index

True

In [28]:
df

     Yil  Temp  Aholi soni   GDP
21  2021  1.54        33.9  1700
20  2020  1.48        33.5  1650
19  2019  1.56        32.9  1600
18  2018  1.62        32.5  1500
17  2017  1.65        31.9  1450
16  2016  1.66        31.4  1400
15  2015  1.64        30.9  1380
10  2010  1.53        28.5  1350

In [29]:
matrix = np.zeros((3, 3))

for i in range(3):
    matrix[i] = i
matrix

array([[0., 0., 0.],
       [1., 1., 1.],
       [2., 2., 2.]])

In [30]:
df.index.difference(df2.index)

Index([10, 15, 16, 17, 18, 19, 20, 21], dtype='int64')

In [31]:
df.index.union(df2.index)

Index([10, 15, 16, 17, 18, 19, 20, 21, 2017, 2019, 2021], dtype='int64')

In [32]:
# read index metodlari

In [33]:
df

     Yil  Temp  Aholi soni   GDP
21  2021  1.54        33.9  1700
20  2020  1.48        33.5  1650
19  2019  1.56        32.9  1600
18  2018  1.62        32.5  1500
17  2017  1.65        31.9  1450
16  2016  1.66        31.4  1400
15  2015  1.64        30.9  1380
10  2010  1.53        28.5  1350

In [34]:
data = {
    'Yil':        [2021, 2020, 2019, 2018, 2017, 2016, 2015, 2010],
    'Aholi soni': [33.9, 33.5, 32.9, 32.5, 31.9, 31.4, 30.9, 28.5], 
    'Temp':       [1.54, 1.48, 1.56, 1.62, 1.65, 1.66, 1.64, 1.53],
    'Zichlik':    [79.77, 78.68, 77.53, 76.34, 75.15, 73.91, 72.71, 67.03]
}

In [35]:
df = pd.DataFrame(data)
df

    Yil  Aholi soni  Temp  Zichlik
0  2021        33.9  1.54    79.77
1  2020        33.5  1.48    78.68
2  2019        32.9  1.56    77.53
3  2018        32.5  1.62    76.34
4  2017        31.9  1.65    75.15
5  2016        31.4  1.66    73.91
6  2015        30.9  1.64    72.71
7  2010        28.5  1.53    67.03

In [36]:
# index qiymatini o'gartirish
df.index = [21,20,19,18,17,16,15,10]
df

     Yil  Aholi soni  Temp  Zichlik
21  2021        33.9  1.54    79.77
20  2020        33.5  1.48    78.68
19  2019        32.9  1.56    77.53
18  2018        32.5  1.62    76.34
17  2017        31.9  1.65    75.15
16  2016        31.4  1.66    73.91
15  2015        30.9  1.64    72.71
10  2010        28.5  1.53    67.03

In [37]:
# index yordamida tartibni o'zgartirish
# Reindex
ind = [21,20,19,18,17,16,15,10]
ind.sort()
ind

[10, 15, 16, 17, 18, 19, 20, 21]

In [38]:
df.reindex(ind)

     Yil  Aholi soni  Temp  Zichlik
10  2010        28.5  1.53    67.03
15  2015        30.9  1.64    72.71
16  2016        31.4  1.66    73.91
17  2017        31.9  1.65    75.15
18  2018        32.5  1.62    76.34
19  2019        32.9  1.56    77.53
20  2020        33.5  1.48    78.68
21  2021        33.9  1.54    79.77

In [39]:
df = df.reindex(ind)
df

     Yil  Aholi soni  Temp  Zichlik
10  2010        28.5  1.53    67.03
15  2015        30.9  1.64    72.71
16  2016        31.4  1.66    73.91
17  2017        31.9  1.65    75.15
18  2018        32.5  1.62    76.34
19  2019        32.9  1.56    77.53
20  2020        33.5  1.48    78.68
21  2021        33.9  1.54    79.77

In [40]:
# saqlab qoladigan index qoladi
df.reindex([10,15,20])

     Yil  Aholi soni  Temp  Zichlik
10  2010        28.5  1.53    67.03
15  2015        30.9  1.64    72.71
20  2020        33.5  1.48    78.68

In [41]:
df.reindex(index=range(10,22), method='nearest') #bu noto'g'ri

     Yil  Aholi soni  Temp  Zichlik
10  2010        28.5  1.53    67.03
11  2010        28.5  1.53    67.03
12  2010        28.5  1.53    67.03
13  2015        30.9  1.64    72.71
14  2015        30.9  1.64    72.71
15  2015        30.9  1.64    72.71
16  2016        31.4  1.66    73.91
17  2017        31.9  1.65    75.15
18  2018        32.5  1.62    76.34
19  2019        32.9  1.56    77.53
20  2020        33.5  1.48    78.68
21  2021        33.9  1.54    79.77

In [42]:
df.reindex(index=range(10,22), method='ffill')

     Yil  Aholi soni  Temp  Zichlik
10  2010        28.5  1.53    67.03
11  2010        28.5  1.53    67.03
12  2010        28.5  1.53    67.03
13  2010        28.5  1.53    67.03
14  2010        28.5  1.53    67.03
15  2015        30.9  1.64    72.71
16  2016        31.4  1.66    73.91
17  2017        31.9  1.65    75.15
18  2018        32.5  1.62    76.34
19  2019        32.9  1.56    77.53
20  2020        33.5  1.48    78.68
21  2021        33.9  1.54    79.77

In [43]:
df.reindex(columns=['Aholi soni', 'Temp', 'Zichlik'])

    Aholi soni  Temp  Zichlik
10        28.5  1.53    67.03
15        30.9  1.64    72.71
16        31.4  1.66    73.91
17        31.9  1.65    75.15
18        32.5  1.62    76.34
19        32.9  1.56    77.53
20        33.5  1.48    78.68
21        33.9  1.54    79.77

In [44]:
df.loc[[10, 15,18, 20], ['Aholi soni', 'Temp', 'Zichlik']]

    Aholi soni  Temp  Zichlik
10        28.5  1.53    67.03
15        30.9  1.64    72.71
18        32.5  1.62    76.34
20        33.5  1.48    78.68

## Qator va ustunlarni tashlab yuborish

In [45]:
df2 = df.drop(10)
df2

     Yil  Aholi soni  Temp  Zichlik
15  2015        30.9  1.64    72.71
16  2016        31.4  1.66    73.91
17  2017        31.9  1.65    75.15
18  2018        32.5  1.62    76.34
19  2019        32.9  1.56    77.53
20  2020        33.5  1.48    78.68
21  2021        33.9  1.54    79.77

In [46]:
df.drop([10, 20])

     Yil  Aholi soni  Temp  Zichlik
15  2015        30.9  1.64    72.71
16  2016        31.4  1.66    73.91
17  2017        31.9  1.65    75.15
18  2018        32.5  1.62    76.34
19  2019        32.9  1.56    77.53
21  2021        33.9  1.54    79.77

In [47]:
df.drop('Yil', axis=1)

    Aholi soni  Temp  Zichlik
10        28.5  1.53    67.03
15        30.9  1.64    72.71
16        31.4  1.66    73.91
17        31.9  1.65    75.15
18        32.5  1.62    76.34
19        32.9  1.56    77.53
20        33.5  1.48    78.68
21        33.9  1.54    79.77

In [48]:
df

     Yil  Aholi soni  Temp  Zichlik
10  2010        28.5  1.53    67.03
15  2015        30.9  1.64    72.71
16  2016        31.4  1.66    73.91
17  2017        31.9  1.65    75.15
18  2018        32.5  1.62    76.34
19  2019        32.9  1.56    77.53
20  2020        33.5  1.48    78.68
21  2021        33.9  1.54    79.77

In [49]:
type(df)

pandas.core.frame.DataFrame

In [56]:
# Series ko'rinishida olish
data = df['Aholi soni']
data

10    28.5
15    30.9
16    31.4
17    31.9
18    32.5
19    32.9
20    33.5
21    33.9
Name: Aholi soni, dtype: float64

In [52]:
type(data)

pandas.core.series.Series

In [55]:
# DF ko'rinishida olish 2 ta qavs 
data = df[['Aholi soni']]
data
type(data)

pandas.core.frame.DataFrame

In [58]:
data

10    28.5
15    30.9
16    31.4
17    31.9
18    32.5
19    32.9
20    33.5
21    33.9
Name: Aholi soni, dtype: float64

In [63]:
data[[21]]

21    33.9
Name: Aholi soni, dtype: float64

In [66]:
data[0:4]

10    28.5
15    30.9
16    31.4
17    31.9
Name: Aholi soni, dtype: float64

In [68]:
data[[10,15,16,17]] # index bn chaqirganda 2 ta qavs

10    28.5
15    30.9
16    31.4
17    31.9
Name: Aholi soni, dtype: float64

In [73]:
obj = pd.Series(np.arange(8.), index=['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
f    5.0
g    6.0
h    7.0
dtype: float64

In [74]:
obj['a']

0.0

In [75]:
obj['c':'h']

c    2.0
d    3.0
e    4.0
f    5.0
g    6.0
h    7.0
dtype: float64

In [76]:
obj[0:4]

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [77]:
obj['a':'c'] = 15
obj

a    15.0
b    15.0
c    15.0
d     3.0
e     4.0
f     5.0
g     6.0
h     7.0
dtype: float64

In [82]:
# Filtrlash
obj[obj<15]

d    3.0
e    4.0
f    5.0
g    6.0
h    7.0
dtype: float64

## Elementlarni tanlash. Datafreym

In [85]:
uz = {2020:33.5, 2019:32.9, 2018:32.5, 2017:31.9, 2016:31.4, 2015:30.9}
kz = {2020:18.8, 2019:18.5, 2018:18.3, 2017:18.1, 2016:17.8, 2015:17.6}
tj = {2020:9.5,  2019:9.3,  2018:9.1,  2017:8.9,  2016:8.7,  2015:8.5}
kg = {2020:5.5,  2019:6.4,  2018:6.3,  2017:6.2,  2016:6.1,  2015:6}
tr = {2020:6.0,  2019:5.9,  2018:5.9,  2017:5.8,  2016:5.6,  2015:5.6}

df = pd.DataFrame(
    {'Uzbekistan': uz, 
     'Kazakhstan': kz,
     'Tajikistan': tj,
     'Kyrgistan' : kg,
     'Turkmenistan' : tr
    }
)

In [86]:
df

      Uzbekistan  Kazakhstan  Tajikistan  Kyrgistan  Turkmenistan
2020        33.5        18.8         9.5        5.5           6.0
2019        32.9        18.5         9.3        6.4           5.9
2018        32.5        18.3         9.1        6.3           5.9
2017        31.9        18.1         8.9        6.2           5.8
2016        31.4        17.8         8.7        6.1           5.6
2015        30.9        17.6         8.5        6.0           5.6

In [88]:
df['Uzbekistan']

2020    33.5
2019    32.9
2018    32.5
2017    31.9
2016    31.4
2015    30.9
Name: Uzbekistan, dtype: float64

In [90]:
df[['Uzbekistan']]

      Uzbekistan
2020        33.5
2019        32.9
2018        32.5
2017        31.9
2016        31.4
2015        30.9

In [91]:
#Numpy arrayga aylantirish
df['Uzbekistan'].to_numpy()

array([33.5, 32.9, 32.5, 31.9, 31.4, 30.9])

In [92]:
df>10

      Uzbekistan  Kazakhstan  Tajikistan  Kyrgistan  Turkmenistan
2020        True        True       False      False         False
2019        True        True       False      False         False
2018        True        True       False      False         False
2017        True        True       False      False         False
2016        True        True       False      False         False
2015        True        True       False      False         False

In [94]:
df[['Uzbekistan']] [df['Uzbekistan']>32]

      Uzbekistan
2020        33.5
2019        32.9
2018        32.5

In [104]:
df2 = df.T
df2

              2020  2019  2018  2017  2016  2015
Uzbekistan    33.5  32.9  32.5  31.9  31.4  30.9
Kazakhstan    18.8  18.5  18.3  18.1  17.8  17.6
Tajikistan     9.5   9.3   9.1   8.9   8.7   8.5
Kyrgistan      5.5   6.4   6.3   6.2   6.1   6.0
Turkmenistan   6.0   5.9   5.9   5.8   5.6   5.6

In [106]:
df2[df2[2015]>6]

            2020  2019  2018  2017  2016  2015
Uzbekistan  33.5  32.9  32.5  31.9  31.4  30.9
Kazakhstan  18.8  18.5  18.3  18.1  17.8  17.6
Tajikistan   9.5   9.3   9.1   8.9   8.7   8.5

## .loc/iloc va .at/.iat

In [107]:
df

      Uzbekistan  Kazakhstan  Tajikistan  Kyrgistan  Turkmenistan
2020        33.5        18.8         9.5        5.5           6.0
2019        32.9        18.5         9.3        6.4           5.9
2018        32.5        18.3         9.1        6.3           5.9
2017        31.9        18.1         8.9        6.2           5.8
2016        31.4        17.8         8.7        6.1           5.6
2015        30.9        17.6         8.5        6.0           5.6

In [110]:
df.loc[[2017]]

      Uzbekistan  Kazakhstan  Tajikistan  Kyrgistan  Turkmenistan
2017        31.9        18.1         8.9        6.2           5.8

In [112]:
df.loc[[2015, 2020], ['Uzbekistan', 'Tajikistan']]

      Uzbekistan  Tajikistan
2015        30.9         8.5
2020        33.5         9.5

In [113]:
df.iloc[[0,4]]

      Uzbekistan  Kazakhstan  Tajikistan  Kyrgistan  Turkmenistan
2020        33.5        18.8         9.5        5.5           6.0
2016        31.4        17.8         8.7        6.1           5.6

In [114]:
df.iloc[[0,4], [0,3]]

      Uzbekistan  Kyrgistan
2020        33.5        5.5
2016        31.4        6.1

In [115]:
df.at[2015, 'Tajikistan']

8.5

In [116]:
df.at[2020, 'Tajikistan']

9.5

In [117]:
df.iat[2,1]

18.3

In [118]:
df

      Uzbekistan  Kazakhstan  Tajikistan  Kyrgistan  Turkmenistan
2020        33.5        18.8         9.5        5.5           6.0
2019        32.9        18.5         9.3        6.4           5.9
2018        32.5        18.3         9.1        6.3           5.9
2017        31.9        18.1         8.9        6.2           5.8
2016        31.4        17.8         8.7        6.1           5.6
2015        30.9        17.6         8.5        6.0           5.6